Repository: Saman-Zand-H/SchoolManagement
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fa

source: Name
fa: نام

source: e.g. John Gobbles
fa: مثلا علی علی زاده

source: Email Address
fa: آدرس ایمیل

source: e.g. example@example.com
fa: مثلا example@example.com

source: Issues or Requests
fa: پیشنهادات یا انتقادات

source: here goes your text....
fa: متن خود را اینجا وارد کنید....

source: Thanks for your message. Message sent successfully.
fa: از پیام شما متشکریم. پیام شما با موفقیت ارسال شد.

source: An internal error happened. Please call us as soon as you can.
fa: مشکلی داخلی بوجود آمده است. لطفا در اسرع وقت با ما تماس بگیرید.

source: Provided inputs are invalid.
fa: اطلاعات وارد شده نادرست است.

source: Student Class
fa: کلاس دانش آموز

source: A non-student typed user was being used as a student.
fa: یک غیر دانش آموز درحال ثبت شدن بعنوان داشن آموز بود.

source: {} is not a student. User must be typed as a student.
fa: {} یک دانش آموز نیست. تایپ کاربر باید دانش آموز باشد.

source: Name of your school
fa: نام مدرسه شما

source: Class ID
fa: نام کلاس

source: A unique identifier for class
fa: یک نام یکتا برای این کلاس.

source: This class already exists
fa: این کلاس در حال حاضر وجود دارد.

source: Courses
fa: دوره ها

source: Phonenumber
fa: شماره همراه

source: Classes
fa: کلاس ها

source: Class
fa: کلاس

source: You registered successfully.
fa: شما با موفقیت ثبت نام کردید.

source: Class saved successfully.
fa: کلاس با موفقیت ذخیره شد.

source: Class updated successfully.
fa: کلاس با موفقیت بروز شد.

source: Class deleted successfully.
fa: کلاس با موفقیت حذف شد.

source: Teacher created successfully.
fa: معلم با موفقیت ساخته شد.

source: Changes saved successfully.
fa: تغییرات با موفقیت ذخیره شد.

source: Invalid inputs detected. Consider that empty inputs are not allowed.
fa: ورودی نامعتبر یافت شد. درنظر بگیرید که ورودی های خالی معتبر نیستند.

source: Teacher deleted successfully.
fa: معلم با موفقیت حذف شد.

source: Course created successfully.
fa: دوره آموزشی با موفقیت ساخته شد.

source: Course deleted successfully.
fa: دوره آموزشی با موفقیت حذف شد.

source: Student created successfully.
fa: دانش آموز با موفقیت ساخته شد.

source: Student updated successfully.
fa: دانش آموز با موفقیت بروز شد.

source: Student deleted successfully.
fa: دانش آموز با موفقیت حذف شد.

source: Bio was updated successfully.
fa: درباره من با موفقیت بروز شد.

source: Provided grade is not valid.
fa: نمره وارد شده معتبر نیست.

source: A non-teacher typed user was being used as a teacher.
fa: یک کاربر غیر معلم درحال ثبت شدن بعنوان معلم بود.

source: {} is not a teacher. User must be typed as a teacher.
fa: {} یک دانش آموز نیست. تایپ کاربر باید دانش آموز باشد.

source: Exam created successfully.
fa: امتحان با موفقیت ساخته شد.

source: Exam deleted successfully.
fa: امتحان با موفقیت حذف شد.

source: Grades submitted successfully.
fa: نمرات با موفقیت ذخیره شدند.

source: Grades cannot exceed the full score.
fa: نمرات نمیتوانند از نمره کامل بیشتر باشند.

source: Bio updated successfully.
fa: درباره من با موفقیت بروز شد.

source: Unsupported file extension.
fa: فایل پشتیبانی نشده.

source: Maximum file size is 3MB.
fa: بیشینه حجم فایل ۳ مگابایت است.

source: Firstname
fa: نام

source: enter your first name
fa: نام خود را وارد کنید

source: Lastname
fa: نام خانوادگی

source: enter your last name
fa: نام خانوادگی خود را وارد کنید

source: Avatar Picture
fa: تصویر کاربری

source: ID
fa: شناسه

source: User ID
fa: نام کاربری

source: E-Mail Address
fa: آدرس ایمیل

source: Password
fa: رمزعبور

source: Confirm Password
fa: تایید رمز

source: This ID already exists.
fa: این شناسه کاربری در حال حاضر موجود است.

source: Your ID
fa: شناسه شما

source: like
fa: مانند

source: please enter the code sent to you
fa: لطفا کدی را که برای شما ارسال کردیم وارد کنید

source: Unsupported file detected by: {}.
fa: فایل پشتیبانی نشده بارگذاری شد توسط: {}.

source: Invalid file extension.
fa: پسوند نامعتبر.

source: Maximum image file size exceeded by: {}.
fa: حداکثر حجم فایل نقض شد توسط: {}.

source: Unacceptable file size.
fa: حجم غیرقابل قبول.

source: English
fa: انگلیسی

source: Persian
fa: فارسی

source: Add Phonenumber
fa: افزودن شماره موبایل

source: Submit
fa: ثبت

source: E-Mail Addresses
fa: آدرس های ایمیل

source: The following e-mail addresses are associated with your account:
fa: آدرس های ایمیل مقابل در حساب کاربری شما ثبت شده اند.

source: Verified
fa: تایید شده

source: Unverified
fa: تایید نشده

source: Primary
fa: اصلی

source: Make Primary
fa: ایمیل اصلی شود

source: Remove
fa: حذف

source: Re-send Verification
fa: ارسال مجدد تاییدیه ایمیل

source: Warning:
fa: :هشدار

source: Add E-Mail Address
fa: افزودن آدرس ایمیل

source: Profile Page
fa: صفحه کاربر

source: Hello from %(site_name)s!
fa: با سلام از %(site_name)s

source: Thank you for using %(site_name)s! %(site_domain)s
fa: با تشکر برای انتخاب %(site_name)s %(site_domain)s

source: You're receiving this e-mail because user %(user_display)s has given your e-mail address to register an account on %(site_domain)s. To confirm this is correct, go to %(activate_url)s
fa: شما این ایمیل را دریافت کرده اید زیرا کاربر %(user_display)s این آدرس ایمیل را در %(site_domain)s به نام خود ثبت کرده است./nبرای تایید این ایمیل بر روی لینک کلیک کنید: %(activate_url)s:

source: Please Confirm Your E-mail Address
fa: لطفا ایمیل خود را تایید کنید

source: You're receiving this e-mail because you or someone else has requested a password for your user account. It can be safely ignored if you did not request a password reset. Click the link below to reset your password.
fa: شما این ایمیل را دریاقت کرده اید زیرا شما یا فرد دیگری این آدرس ایمیل را در برای بازیابی رمزعبور ثبت کرده است./nاگر شما این درخواست را نکرده‌اید میتوانید این ایمیل را نا دیده بگیرید. در غیر این صورت بر روی لینک زیر کلیک کنید.

source: In case you forgot, your username is %(username)s.
fa: اگر فراموش کرده‌اید، شناسه کاربری شما %(username)s هست.

source: Password Reset E-mail
fa: ایمیل بازیابی رمزعبور

source: E-Mail Confirmation
fa: تایید ایمیل

source: Confirm
fa: تایید

source: Please confirm that <a href="mailto:%(email)s">%(email)s</a> is an e-mail address for user %(user_display)s.
fa: لطفا تایید کنید <a href="mailto:%(email)s">%(email)s</a> یک ایمیل برای .کاربر %(user_display)s است

source: This e-mail confirmation link expired or is invalid. Please <a href="%(email_url)s">issue a new e-mail confirmation request</a>.
fa: این لینک منقضی شده یا نامعتبر است. لطفا <a href="%(email_url)s">درخواست .لینک جدید</a> بدهید

source: Sign In
fa: ورود

source: Add your credentials
fa: اطلاعات کاربری خود را وارد کنید

source: Did you forget your password?
fa: رمز خود را فراموش کرده اید؟

source: Or <a href="%(signup_url)s">create a new account</a>
fa: یا <a href="%(signup_url)s">یک حساب کاربری ایجاد کنید</a>

source: Get Support
fa: درخواست پشتیبانی

source: Log Out
fa: خروج

source: Sign Out
fa: خروج

source: Dashboard
fa: داشبورد

source: Logout
fa: خروج از حساب کاربری

source: Are you sure you want to sign out?
fa: آیا اطمینان دارید که میخواهید از حساب کابری خود خارج بشوید؟

source: Sign out
fa: خارج شو

source: You cannot remove your primary e-mail address (%(email)s).
fa: شما نمیتوانید ایمیل اصلی خود را (%(email)s) حذف کنید.

source: Confirmation e-mail sent to %(email)s.
fa: ایمیل تایید آدرس ایمیل به %(email)s ارسال شد.

source: You have confirmed %(email)s.
fa: شما ایمیل خود %(email)s را تایید کرده‌اید.

source: Removed e-mail address %(email)s.
fa: %(email)s با موفقیت حذف شد.

source: Successfully signed in as %(name)s.
fa: شما با موفقیت با شناسه %(name)s وارد حساب خود شده‌اید.

source: You have signed out.
fa: شما با موفقیت از حساب کاربری خود خارج شده‌اید.

source: Password successfully changed.
fa: رمز عبور با موفقیت تغییر یافت.

source: Password successfully set.
fa: رمز عبور با موفقیت تعیین شد.

source: Primary e-mail address set.
fa: آدرس ایمیل اصلی تعیین شد.

source: Your primary e-mail address must be verified.
fa: ایمیل اصلی شما باید تایید شود.

source: Reset Password
fa: بازیابی رمزعبور

source: Reset your password
fa: رمزعبور خود را بازیابی کنید

source: Or <a href="%(login_url)s">log in</a>
fa: یا <a href="%(login_url)s">وارد حساب کاربری خود شوید</a>

source: Reset Link Sent
fa: لینک بازیابی ارسال شد

source: We have sent you an e-mail. Please contact us if you do not receive it within a few minutes.
fa: ما برای شما یک ایمیل فرستاده‌ایم. اگر تا دقایق آینده ایمیلی دریافت نکردید، لطفا با ما تماس بگیرید.

source: Change Password
fa: تغییر رمزعبور

source: The password reset link was invalid, possibly because it has already been used. Please request a <a href="%(passwd_reset_url)s">new password reset</a>.
fa: لینک بازیابی رمز نامعتبر است، احتمالا به این دلیل که این لینک منقضی شده. .لظفا <a href="%(passwd_reset_url)s">درخواست یک لینک دیگر بدهید</a>

source: Your password is now changed.
fa: رمز عبور شما با موفقیت تغییر کرد

source: Go back to login page
fa: بازگشت به صفحه ورود

source: School Registration
fa: ثبت‌نام مدرسه

source: Sign Up
fa: ایجاد حساب کاربری

source: Join us
fa: به ما بپیوندید

source: Your password can’t be too similar to your other personal information.
fa: رمز عبور شما نمیتواند با اطلاعات دیگر شما شباهت زیادی داشته باشد.

source: Your password must contain at least 8 characters.
fa: رمز عبور شما باید شامل ۸ کاراکتر باشد.

source: Your password can’t be a commonly used password.
fa: رمز عبور شما نمیتواند رمز عبور پر استفاده ای باشد.

source: Your password can’t be entirely numeric.
fa: رمز عبور شما نمیتواند فقط عددی باشد.

source: The size of your file can't exceed 3MB.
fa: حجم فایل شما باید کمتر از ۳ مگابایت باشد.

source: Allowed extensions are .jpg and .png.
fa: پسوند های مجاز: png و jpg.

source: Or if you already have an account <a href="%(login_url)s">log in</a> .
fa: یا اگر درحال جاضر یک حساب کاربری دارید <a href="%(login_url)s">وارد حساب خود شوید</a>

source: Verify Phonenumber
fa: شماره همراه خود را تایید کنبد

source: Phonenumber Verification
fa: تایید شماره همراه

source: Verify
fa: تایید

source: Support
fa: پشتیبانی

source: Send us your issues and suggestions
fa: انتقادات و پشنهادات خود را برای ما ارسال کنید

source: New
fa: جدید

source: Create a new class
fa: ایجاد کلاس جدید

source: these fields are required
fa: این فیلد ها الزامی‌اند

source: Invalid Inputs:
fa: ورودی غیرقابل قبول:

source: You haven't created any course yet.
fa: در حال حاضر شما هیچ دوره آموزشی‌ ای درست نکرده‌اید.

source: Close
fa: بستن

source: Create
fa: ساختن

source: Courses Count
fa: تعداد دوره ها

source: Students Count
fa: تعداد دانش آموزان

source: Students
fa: دانش آموزان

source: Performance
fa: عملکرد

source: No student in this class
fa: دانش آموزی در این کلاس وجود ندارد

source: No class is created yet.
fa: هیچ کلاسی ساخته نشده‌است.

source: Class:
fa: کلاس:

source: Edit
fa: تغییر

source: Delete
fa: حذف

source: Delete Class
fa: حذف امتحان

source: Are You sure you want to delete this class PERMANENTLY?
fa: آیا اطمینان دارید که میخواهید این کلاس را برای همیشه پاک کنید؟

source: No
fa: نه

source: Yes
fa: آره

source: Edit this Class
fa: تغییر کلاس

source: Teacher:
fa: معلم:

source: No course is added yet.
fa: هیچ دوره ای اضافه نشده‌است.

source: Picture
fa: تصویر

source: No student is added to this class yet.
fa: هیچ دانش آموزی به این کلاس افزوده نشده است.

source: Home
fa: صفحه اصلی

source: School
fa: مدرسه

source: Teachers
fa: معلم ها

source: Overview
fa: دیدکلی

source: Profile
fa: صفحه کاربری

source: Hello
fa: سلام

source: This is your profile page.
fa: اینجا صفحه کاربری شما است.

source: Edit profile
fa: تغییر اطلاعات کاربری

source: User's information
fa: اطلاعات کاربر

source: Email address
fa: آدرس ایمیل

source: Phone Number
fa: شماره همراه

source: Manage your e-mail addresses
fa: مدیریت ایمیل ها

source: Change Your Password
fa: تغییر رمز

source: Change
fa: تغییر

source: About me
fa: درباره من

source: Bio
fa: بیو

source: A few words about you ...
fa: چند کلمه درباره شما...

source: Create A New Teacher
fa: ایجاد معلم جدید

source: Allowed extensions: .jpg and .png.
fa: پسوند های مجاز: jpg و png.

source: ID:
fa: نام کاربری:

source: No student is created yet.
fa: در حال حاضر هیچ دانش آموزی ساخته نشده است.

source: Delete Student
fa: دانش آموزان

source: Are You sure you want to delete this student PERMANENTLY?
fa: آیا اطمینان دارید که میخواهید این دوره را برای همیشه حذف کنید؟

source: Current Information
fa: اطلاعات فعلی

source: Name:
fa: نام:

source: Phonenumber:
fa: شماره همراه:

source: Change Information
fa: تغییر اطلاعات

source: Save Changes
fa: ذخیره تغییرات

source: Create a new course
fa: ایجاد یک دوره آموزشی جدید

source: No course is created yet.
fa: هیچ دوره آموزشی ای ساخته نشده است.

source: Subjects
fa: درس ها

source: Delete Course
fa: حذف

source: Are You sure you want to delete this course PERMANENTLY?
fa: آیا اطمینان دارید که میخواهید این کلاس را برای همیشه پاک کنید؟

source: Teacher
fa: معلم

source: No student in this class.
fa: هیچ دانش آموزی در این کلاس وجود ندارد.

source: This course is not used by any class.
fa: این دوره توسط هیچ کلاسی استفاده نشده است.

source: Courses:
fa: دوره های آموزشی:

source: Degree:
fa: مدرک:

source: No teacher is added yet.
fa: در حال حاضر هیچ معلمی اضافه نشده است.

source: Delete Teacher
fa: حذف معلم

source: Are You sure you want to delete this teacher PERMANENTLY?
fa: آیا اطمینان دارید که میخوهید این معلم را برای همیشه پاک کنید؟

source: This teacher has not been added to any class yet.
fa: این معلم به هیچ کلاسی افزوده نشده است.

source: This teacher is not added to any course.
fa: این معلم به هیچ دوره ای افزوده نشده است.

source: Subject
fa: درس

source: All
fa: همه

source: Average Grade
fa: نمره میانگین

source: Sorry! We cannot find any class for you.
fa: متاسفانه کلاسی برای شما پیدا نشد.

source: Exams
fa: امتحان ها

source: Filters
fa: فیلتر ها

source: New Exam
fa: امتحان جدید

source: Full Score
fa: نمره کامل

source: e.g. 100 or ...
fa: به طور مثال 20 یا 100 یا ...

source: Date
fa: تاریخ

source: Choose using the datepicker
fa: با استفاده از تقویم تاریخ خود را انتخاب کنید

source: Add
fa: افزودن

source: Filter Exams
fa: فیلتر کردن امتحان ها

source: All exams corresponding to the following details:
fa: تمام امتحانات با ویژگی های زیر:

source: Since
fa: از زمان

source: Until
fa: تا زمان

source: Filter
fa: فیلتر

source: Date:
fa: تاریخ:

source: Full Score:
fa: نمره کامل:

source: Average Grade:
fa: نمره میانگین:

source: No exam is created yet.
fa: امتحانی ساخته نشده‌است.

source: Grades
fa: نمره ها

source: Add Grades
fa: افزودن نمرات

source: Grade
fa: نمره

source: Delete Exam
fa: حذف امتحان

source: Are You sure you want to delete this exam PERMANENTLY?
fa: آیا اطمینان دارید که میخواهید این امتحان را حذف کنید؟

source: Student
fa: دانش آموز

source: No grade is submitted yet.
fa: هیچ نمره ای ثبت نشده است.

source: Taken Exams
fa: امتحان های برگزار شده

source: Average Performance
fa: عملکرد میانگین

source: No Class
fa: هیچ کلاسی

source: Total Performance
fa: عملکرد کلی

source: No student found.
fa: دانش آموزی یافت نشد.

source: Error 403
fa: خطای 403

source: Oops... Error 403.
fa: اوپس... خطای 403

source: ACCESS DENIED
fa: دسترسی غیرمجاز

source: You must <a href="%(create_school_url)s">register your school</a>.
fa: شما باید <a href="%(create_school_url)s">مدرسه خود زا ثبت‌نام کنید</a>.

source: Go back to <a href="%(home_url)s">homepage</a>.
fa: بازگشت به<a href="%(home_url)s">صفحه اصلی</a>.

source: Error 404
fa: حطای 404

source: Oops... Error 404.
fa: اوپس... خطای 404

source: PAGE NOT FOUND
fa: صفحه مورد نظر یافت نشد

source: Error 500
fa: خطای 500

source: Oops... Error 500.
fa: اوپس... خطای 500

source: SERVER ERROR
fa: خطای سرور

source: Please <a href="%(support_page)s">contact support</a>.
fa: لطفا <a href="%(support_page)s">با ما تماس بگیرید</a>.

source: DjS School
fa: تخته وایت‌برد

source: Django Solutions
fa: راه‌های جنگویی

source: Contact
fa: ارتباط با ما

source: Create Your School
fa: مدرسه خودرا بسازید

source: Log In
fa: ورود به حساب کاربری

source: About DjS School
fa: درباره تخته وایت‌برد

source: Get to know us
fa: ما را بیشتر بشناسید

source: DjS School offers Management tools for managing your school. From administrators to teachers can use our app.
fa: تخته وایت‌برد ابزار هایی را برای مدیریت مدرسه شما فراهم میکند. از مدیران گرفته تا معلمان، می توانند از برنامه ما استفاده کنند.

source: We deeply care for how administrators can manage their school more efficiently. Here administrators can create teachers and students, subjects and classes. Teachers are also important to us! Teachers here can create exams and submit grades for students.
fa: ما به این که مدیران چگونه میتوانند مدرسه خود را به طرز کاربردی تری مدیریت کنند اهمیت میدهیم. در برنامه ما، مدیران میتوانند معلم ها، مباحث درسی کلاس های خود، کلاس ها، دانش آموزان و دیگر بخش های کاربردی را برای مدرسه خود ایجاد کنند. معلم ها هم صد البته برای ما اهمیت زیادی دارند. معلم ها در حال حاضر میتوانند امتحانات برگزار شده‌شان را ثبت کرده و برای دانش آموزان کلاسشان نمره ثبت کنند.

source: We take great interest in how our costumers use our app. We are constantly thinking about how to make our app more useful. One of our tools in improving our app is your feedbacks. So please feel free to leave feedbacks. You can do this on the <a href="%(support_page)s">support page</a>.
fa: ما علاقه زیادی به نحوه استفاده کاربرانمون از برنامه خود داریم. ما دائما به فکر کاربردی‌تر سازی این برنامه هستیم. یکی از ابزار های ما در این راه بازخورد های شما است. پس لطفا نظراتتان نسبت به ما را <a href="%(support_page)s">با ما به اشتراک بگذارید.</a>

source: + New Sections
fa: + قسمت های جدید

source: + RESTful APIs
fa: + ای پی آی های رستفول

source: + Chatrooms
fa: + چت روم ها

source: Coming Soon...
fa: به زودی...

source: &copy; DjS School
fa: &copy; تخته وایت‌برد

source: for managing schools more effectively
fa: برای مدیریت کاربردی‌تر مدارس.

source: <a href="%(home_url)s">DjS School</a> - coded by <a target="_blank" href="https://github.com/saman-zand-h">Saman Zand</a>
fa: <a href="%(home_url)s">تخته وایت‌برد</a> - توسعه داده شده توسط <a target="_blank" href="https://github.com/saman-zand-h">سامان زند حقیقی</a>

source: &copy;<a href="%(home_url)s" class="font-weight-bold ml-1"> DjS School</a> - coded by <a target="_blank" href="%(support_url)s">Saman Zand</a>
fa: <a href="%(home_url)s" class="font-weight-bold ml-1">تخته وایت‌برد</a> - توسعه داده شده توسط <a target="_blank" href="https://github.com/saman-zand-h">سامان زند حقیقی</a> &copy;

source: Follow me on Github
fa: من را در گیتهاب دنبال کنید

source: Welcome!
fa: !خوش آمدید

source: My profile
fa: صفحه کاربری من

source: Main Menu
fa: صفحه اصلی
